src/cf/Enums/КодыНоменклатурыВДокументах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>КодыНоменклатурыВДокументах</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Код</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Артикул</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Штрихкод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПустоеЗначение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СпособОтображенияСкидок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособОтображенияСкидок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сумма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Процент</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыНаименованийДляПечатиДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыНаименованийДляПечатиДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сокращенное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полное</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/ПодсистемаНастройки/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// См. ОбновлениеИнформационнойБазыУНФ.ОбновлениеРозницыДоУНФ
Процедура ОбновлениеРозницыДоУНФ() Экспорт
	
	УстановитьКонстантыОбновленияРозницыДоУНФ();
	ЗаполнитьДанныеПриПереходеСРозницы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьКонстантыОбновленияРозницыДоУНФ()
	Возврат;
КонецПроцедуры

Процедура ЗаполнитьДанныеПриПереходеСРозницы()
	Возврат;
КонецПроцедуры

// Заполняет справочник ключевых операций, устанавливает целевое время
Процедура ЗаполнитьРеквизитыКлючевыхОпераций()

	//!!!!! Перенесено в модуль ВозможностиПриложения
	Возврат;
	
	Попытка
		ОценкаПроизводительностиУНФ.ЗаполнитьЦелевоеВремяОперацийПроизводительности();
	Исключение
		ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(НСтр("ru='Заполнение ключевых операций.'", ОбщегоНазначения.КодОсновногоЯзыка()), 
		УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки);
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьНастройкиПредставленийВПечатныхФормахПриНачалеРаботы()

	//!!!!! Перенесено в модуль ВозможностиПриложения
	Возврат;
	
	Если Константы.УдалитьАртикулНоменклатурыВСодержание.Получить() = Истина Тогда
		
		Константы.ПредставлениеКодовВПечатныхФормах.Установить(Перечисления.КодыНоменклатурыВДокументах.Артикул);
		
	Иначе
		
		Константы.ПредставлениеКодовВПечатныхФормах.Установить(Перечисления.КодыНоменклатурыВДокументах.Код);
		
	КонецЕсли;
	
	Константы.ПредставлениеСкидкиВПечатнойФорме.Установить(Перечисления.СпособОтображенияСкидок.Сумма);
	
	Константы.ПредставлениеНомераДокументаБезПрефиксаИнформационнойБазы.Установить(Истина);
	Константы.ПредставлениеНомераДокументаБезПрефиксаПользователя.Установить(Истина);
	Константы.ПредставлениеНомераДокументаБезПрефиксаОрганизации.Установить(Истина);
	Константы.ПредставлениеНомераДокументаСЛидирующимиНулями.Установить(Ложь);
	
	ВидНаименованияСокращенное = Перечисления.ВидыНаименованийДляПечатиДокументов.Сокращенное;
	Константы.ВидНаименованияОрганизацииДляПечатиДокументов.Установить(ВидНаименованияСокращенное);
	
КонецПроцедуры

#КонецОбласти
